/*
 * 吉时雨 (JiShiYu)
 * Copyright (C) 2026 xianbo.chen@gmail.com
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the LICENSE file for more details.
 *
 * If you use this software to provide network services (e.g. SaaS, API),
 * you must make your source code available to users.
 *
 * Commercial licensing is available:
 * 📧 xianbo.chen@gmail.com
 */

layui.define(function (exports) {

    var qiduweng_info = {
        "人物形体": {
            "木": "主人物修长，须发美，眉目秀，肤色白，坐立身多倚侧，声音畅快，音调较高。若木气过衰，则身材瘦小，发稀少，枯焦，眉眼不正，颈长喉凸，皮肤干燥，柔语细声，坐卧行止不稳定。",
            "火": "主人面貌上尖下阔，肉多，印堂窄，眉毛浓，鼻露窍，头小脚长，背部厚实，腹部较宽大。火过则血气旺，头发粗、浓，面色带红，说话速度快，好动。火过衰则身形瘦小偏黑，脸色略黄，语无伦次。",
            "土": "主人头圆、面阔、鼻大、口方、面色黄，眉毛淡而不秀，背厚腰粗，声音重浊，常缄默，静多动少。土过衰则面常有忧愁之相，体格单薄、瘦。",
            "金": "主人脸形方、圆，肤色白皙，眉目英俊，鼻直口正，声音清亮，体质健壮。金太旺则体态略肥，声浊，金过衰则瘦小貌丑。",
            "水": "主人眉清目秀，圆脸，肩不阔，身体易摇摆不定，语音清和，皮肤细白。水太旺则肥大，水过衰则矮小黑丑。"
        },
        "人物性情": {
            "木": "仁慈、忠厚、理智、有主见、虚心、举止稳妥端庄、潇洒。寅木为阳有向上进取之心、正直、风雅、有情义、有责任心、敏捷、有应变力。卯木为阴，柔顺和蔼、有同情心、外表谦虚、内心有占有欲。太旺则暴躁、偏执、固执、嫉妒、宁折不弯、难以与人相处、把简单事情搞复杂化。过衰则优柔寡断、意志薄弱、随波逐流、没有主见、小心眼儿、斤斤计较、办事无条理。",
            "火": "喜修饰、装扮、作风严谨、尊长爱幼、谦和淳朴、大方聪敏、有文彩、有奋发精神、创造力、不畏艰辛。巳火为阴，性格外向、稍显急躁、自尊心强、喜欢表现自我、爱与人争辩、稍乏忍耐力。午火为阳，思维细密、性情和顺、聪明而富有同情心、多疑。太旺则性情暴戾、易冲动而失去理智、做事不计后果而后悔。过衰则生性喜阿谀谄媚、狡诈、狡辩、做事虎头蛇尾、无恒心、不变通、惹人烦、不果断。",
            "土": "稳重、忠诚、孝顺、守信、心胸宽广、有度量、敬信神佛、自信、喜安静、坚忍、有耐心、随和。阳土沈稳，阴土有内涵、才艺。太旺则愚钝、食古不化、执迷不悟、反应慢、喜独处、乖僻、固执、不会虚心改过。过衰则胆小怕事、自私悭吝、不通事理、不得众情、虚伪狡诈。",
            "金": "处事多能、好学上进、好酒好歌、威武坚贞、果断、有情义、仗义疏财、明辨善恶、重名声、通情达理、光明正大、有才华、善交际。申金为阳，粗犷豪放、好胜。酉金为阴，重感情、温润秀气、自尊但虚荣、意志稍不坚。太旺则有勇无谋、义气行事、冲动妄为、爱打杀、喜淫欲。过衰则只在嘴上讲义气而行动上难以做到、犹疑不定、寡言、坐失良机、做事常受挫而导致灰心。",
            "水": "聪慧、思维缜密、胸襟宽广、善良、目光远大、有学问、有见识、有经济头脑。亥水为阴，乐观、外向、勇敢多智、纵欲任性、有惫懒倾向。子水为阳，内向、柔顺、疑心大、计划性强、不务实、常心有不满、重情调、偏执。太旺则诡计多端、喜淫欲、好动、不拘小节、不守礼教、感情不专、心常愁绪、感觉敏锐、忽而善辨多言、忽而缄默沈闷、易呈多情伤感之状。过衰则反复无常、胆小怕事、无远虑，不能自主。"
        },
        "人体部位": {
            "木": "肝、胆、眼睛、眉毛、毛、四肢、神经、脑、筋膜、筋脉。",
            "火": "心脏、小肠（十二指肠）、体温、肌肉、眼睛、舌、扁桃体。",
            "土": "肚腹、脾胃、肠、鼻面、皮肤、唇、胁、后背。",
            "金": "肺、大肠、骨骼、口齿、头、胸、气管、皮毛、大脑、小脑、肋膜、脊骨。",
            "水": "肾、膀胱、泌尿系统、妇科、耳、骨髓、脚、阴部、血液。"
        },
        "职业": {
            "木": "文职、教师、作家、教育界、文化事业、文教、出版社、书店、文具行、文艺、书、纸器、纸张、宗教活动用品、香料、布匹、花木、苗圃、竹林、盆栽、家具、装潢、木材、种植业、医药草药业、公务界、政治、司法、军警。",
            "火": "化工、照明、电力、电器、油炸、自助餐、热食、加工制造、易燃品、加油站、油库、电厂、理烫发业、雕刻艺术、化妆品业、美容业。",
            "土": "建筑、地产、土地买卖、农畜产品、饲料、水泥厂、石雕、石器、瓷器、防水物料、丧葬、经纪人、企业顾问、管理、秘书、设计、基础设施。",
            "金": "金银加工、制造、开矿、银行、金融、五金、机械、汽车、刀模、钢铁厂。",
            "水": "渔业、水产、水利、海产品、航海、防火、冷饮、冷冻、钓具、旅游、记者、导游、演员、搬家业、清洁业、外交。"
        }
    };

    exports("qiduweng_info", qiduweng_info);

});
