
/**
 * 排十神
 * @author xianbo.chen@gmail.com
 */

var HELP_SHISHEN_INFO = {
    "比肩":
    "比肩是与日干同性的五行，比肩对日主而言，是一种可以帮助我，也可以排斥我的一个星，象征着协助和竞争，是一种心性稳重，自尊和善的星，比肩是与日主同类同气的星，在天干叫比肩，在地支叫“禄”，其含义为自尊，自信，自我意识，自主能力，主观性，独立性，个性果断，冷静，亲为，忙碌。<br/>本命中带有独立自主、重朋友的特性。<br/>缺少比肩，朋友少，不愿意主动联系朋友，社交恐惧症，喜欢独来独往，凡事不愿求助别人。<br/><br/>优点<br/><br/>具有强烈之自尊心与自信心，有自知之明，凡事量力而为，不贪非份之想，乐观进取，坚毅不屈，不惧不畏，独立自主，言而有信，意志坚定，凡经决定之事情，必定坚持到底，决不轻易改变，与朋友之情真挚，不轻易向他人低头，一心渴望与他人并驾齐驱，对自己充满信心，坚守岗位，努力工作，达成目标。<br/><br/>缺点<br/><br/>比肩若太旺为忌，则顽固不通，刚愎自用，凡事坚持己见，不易与人沟通，以致易与人发生争执。凡事先为自己，不考虑他人立场，也缺乏容忍之雅量，因此不容易与他人打成一片，交友虽广，却难得知己，表面纵使柔顺，内心也十分刚强，不能付出关怀，以致自己遇到困难时，也不易获得外援，表面虽然口口声声赞美别人，心里却极为不服。具有抗上之心，较得不到上司之提拔与器重。<br/><br/>代表事物<br/><br/>男性兄弟、女性姐妹、邻居、同性的同学、战友、同事、朋友、义气、社会上所有的同行业同性合作伙伴。<br/><br/>命中比肩有用：<br/><br/>可从事的职业有 运动员，演员，生意人，司机，体力劳动者，中介等。<br/><br/>比肩虚透：背信弃义，愿意沾别人的小便宜。<br/><br/>比肩有根：实实在在的帮助别人，讲义气，夺财轻。<br/><br/>比肩无根：虚情假义。<br/><br/>比肩配食神为贵。<br/><br/>口诀：月上比肩怕通天，无有兄弟行影单，如有兄弟不夭折，刑痴痴语或半瘫<br/><br/>身強者<br/><br/>本性不太相信别人，较独立孤独，生活中不管人、事、物常会与人相互争取或计较，同时一定会出现竞争者，感情易出现困扰【比较会失恋】，好胜不服输，善交际，又好客。个性独立，不喜交友，因有过份悲伤的经验。<br/><br/>身弱时<br/><br/>为人喜欢我行我素，不喜欢束缚，决定一件事后，任何人都无法改变他，在理财行为上，也尽量不要跟会 (民间会 )，尽量不要合伙，易被掠夺。<br/><br/>比劫过重<br/><br/>比劫过重要比肩和劫财同时出现。个性阴沉，不喜表达心中意愿，但一被恨到，则难翻身之时，永不与对方讲话。善于询问，但对自己没信心，故常改变决定。钱不要借人，不要跟会，不要合伙，易被劫走，常掉东西，外表乐观，内心想不开，有轻生念头，较凭直觉做事，一生感情困扰，剪不断理还乱，人情包袱很重。 ( 太重人情 ) 要提防落入红尘之环境，耳根软，心神较不专一，易分神，常往坏处想。常聚一群赶不走，却对其没帮助的朋友，易与朋友间产生纷争或争财事，好事难成，易走入不好的环境中。<br/><br/>比肩在年柱<br/><br/>小时侯跟父母亲花很多钱。或一辈子钱财被父母或长上劫走。稳健平和，小时候好玩，不喜欢读书，好交朋友，有钱与人平分共用，小时候家庭经济陷入危机，为钱烦恼，父母缺钱或自己身上花钱【看病】，家境不好，一出生家境就不富裕，从小就优柔寡断，乖巧懂事，身兼数职( 分担起家计)。<br/><br/>比肩在月柱<br/><br/>兄弟姊妹排第一，重视自己朋友，先生或太太排最后，因此常遭先生、太太埋怨，亲兄弟姊妹不会帮忙，须靠自己打拼，有钱兄弟朋友多，没钱时无人过问，常为了钱财与人反目，但有钱会借人家。16-33 岁家中会比较困顿或结婚后会经济较差，看到喜欢的对象说不出话来，不善表达，感情易被劫夺，喜欢的人不会是现在的夫或妻。<br/><br/>比肩在日柱<br/><br/>1. 藏干比肩，配偶重视朋友、兄弟、姊妹远超过于你。<br/>2. 配偶性格刚毅敏捷，思想与己相似。<br/>3. 追求比己年长，成熟之异性为伴侣，较依赖配偶。<br/><br/>比肩在时柱<br/><br/>年老时生病吃药效果不好，与子女互不喜欢同住在一起。累积一生的钱财到了晚年容易流失，疼儿女，事业上和同事间竞争大，不想依靠子女，做事容易改变决定，故事业难成就。儿女过份疼惜舍不得让他们学习或做事，故较无求生本能且没自信心。<br/><br/>比肩格局<br/><br/>身弱者与人合作能发财，一生能得到兄弟姐妹们帮助。身强者与人合作会破财，一生不能得到兄弟姐妹帮助。身弱比肩可帮身，身旺比肩夺财。比肩格和伤官格都不会道歉、死不认错。比肩格要面子、朋友多，大多从事与人合作的工作，例如中介、直销，中间搓合事儿的职业。",
    "劫财":
    "劫财为日主异性的相同者，是帮我做的，但帮助需要我付出代价，因为劫财是夺我财的星。<br/>本命中带有独立自主、重朋友的特性。<br/>缺少劫财，不会利用人。<br/><br/>优点<br/><br/>往往具有独特突出，独树一格之性格，有优异之外交能力与口才，特别是善于在社交场合制造气氛，控制局势，以博取他人之好感，心思敏捷迅速，善于见风转舵，迎合时尚及他人之需，以及环境之因应，可说是具有优异之应变能力，同时又具有行动力，操作欲，谋事积极，勇往直前，冒险犯难，斗志昂扬，不顾生死之特性，也具有薄己利他之心。但因具有双重性格，外表与内心经常自我冲突，自相矛盾，表里不一，因此朋友来得快，也去的快。<br/><br/>缺点<br/><br/>内心经常自相矛盾，自我冲突，以致性情阴晴不定，忽冷忽热，难以捉摸，有时薄己利他，有时又忌妒他人之成就，野心过大，求功心切，往往不经思考，就贸然行动，以致一败涂地。有时又不顾一切，孤    注一掷，而弄得无法收拾。做事横冲直撞，有勇无谋，动不动就想用武力解决，不计后果，招致不可收拾之后果。不善于处理金钱，对朋友十分慷慨，因此易因兄弟或朋友之事与配偶发生之争执，对外面之女性十分体贴多情，但对妻子却显得冷漠。<br/><br/>代表事物<br/><br/>男性姐妹、女性兄弟、街坊、异性的同学、战友、同事、朋友、义气、社会上所有的同行业异性合作伙伴等都看劫财。<br/><br/>劫财起好作用<br/><br/>为运动员，武职，军人，股民等，劫财得用配杀适合武职。<br/><br/>男命带劫财<br/><br/>容易失恋，婚前交女友易有人争，要做什么前最好不要先说。否则易破功，对老婆较没安全感。<br/><br/>女命带劫财过重<br/><br/>易当老二，劫财于任一柱时，恋爱的另一半会出现追求者，所以失恋的机会很大，且是动情刻骨铭心的失恋。 【劫一个就会失恋 2 ~ 3 次】<br/><br/>劫财在年柱<br/><br/>小时候跟父母亲花很多钱，或一辈子钱财被父母或长上劫走。小时候家里会发生事故，会分摊家庭经济，容易欣赏成熟的异性 ( 早熟 )，容易跟人吵架，好玩，好交朋友。父母是他一生最大的挂记 ( 时常记忆小时候 )，出生时正逢家中最困窘的时候。从小就体恤又很懂事。<br/><br/>劫财在月柱<br/><br/>兄弟姊妹排第一，重视自己的朋友、先生或太太反而排最后，因此常遭先生、太太埋怨。易被朋友分割感情( 如男、女朋友 )，早年生活非常辛苦。会为朋友、平辈、兄弟姐妹而失财，付出多，会替人担忧，别人不一定会帮忙，有钱兄弟多，没钱无人过问，钱是有借无还。容易被欠钱，且不好意思去要回来，结婚后就开始走拮据的人生。<br/><br/>劫财在日柱<br/><br/>1. 劫财，配偶易破财。<br/>2. 夫妻常有感情困扰之事。<br/><br/>劫财在时柱<br/><br/>年老时，生病吃药效果不好，与子女互不喜欢同时住在一起。事业被伙伴及子女劫财，很疼儿女，有求必应，凡事不能坚持，晚年财务不好，借人家钱不敢要回来，越老越自卑，自尊心强之故，大都不跟子女同住，答应了，越常常反悔改变，子女对外求生能力弱。<br/><br/>劫财格局<br/><br/>好赌博、好喝酒、好色、见面熟、情商高、见人说人话，见鬼说鬼话、会吹牛、喜欢借别人的钱。男命劫财多克妻。比肩格、劫财格一生追求：平平安安、顺其自然、野心不大。",
    "食神":
    "日主所生者同性为食神。代表思想，口才，享受，玩乐，会打扮，名声，也代表寿禄，食神是个快乐之神，愿意奉献，对人和蔼，喜自由，不喜约束，爱表现但不计较名次，不喜欢强迫自己做某一件事，正统，守德，聪明，食神多好幻想，重感情，易钻牛角尖。<br/>命中带有食神性格斯文、欢喜心的特性 ( 按条理走，较有口福且口感特好，总能找到好吃得食物，有气质，纤细柔美 )。<br/>缺少食神口才不好，不善言辞。<br/><br/>优点<br/><br/>气质清高，温文儒雅，性格开朗，精神和畅，聪明细腻，通情达理，宽容厚道，和平善良，不与人争，骄而不傲，感情丰富，悠游自足，思想清新脱俗，喜爱美好事物，表达流畅，重视情调，调和精神与物质之均衡发展，对于文学、艺术、歌舞等具有偏好与关心，且有敏锐之感受力，精于饮食之道，一生衣食丰厚。与人相处含蓄保守，温厚有礼，表达生动但不夸张，虽出风头但含蓄而不露锋芒。喜于付出但不强求回报，活泼乖巧而不任性叛逆，谋事专一，习一技而至精，故能深入而成专家。<br/><br/>缺点<br/><br/>由于思想清高，容易养成自命不凡之心性，有时因理想过高，以致与现实脱节，喜欢悠游自足，无拘无束之生活，也意沉迷于游乐，忽视现实生活，失去奋发进取之精神，做事虽有耐心，却常感体力不支，容易疲劳，或由于思考旺盛，喜欢动脑筋而引起脑神经衰弱或头疼。幻想过度而至空虚寂寞之感。或因理想太高太多，不能实现，每有怀才不遇，有志难伸之感。<br/><br/>代表事物<br/><br/>食神代表头脑的记忆力、食神还代表逻辑思维、分析判断、智商优劣、精神健康、食神代表男命儿子、女命女儿等。<br/><br/>食神为用<br/><br/>自尊自重、深沉纯真、内向聪明、谦虚炼达、温和宽厚、知礼孝顺、思维全面、耐力超常、仁慈博爱。考虑问题全面、细致，出了正向思维和逆向思维还会立体思维和爆发思维。适合等行业宗教，文学艺术，美学音乐、经济影艺。<br/><br/>食神为忌<br/><br/>考虑问题简单，不全面，不细致。记忆力不好<br/><br/>身弱时<br/><br/>才华不显【无法用来赚钱】，体力较不好。身弱较不稳定，样样都想学，却样样都不精。雕虫小技。(若成为从儿格或从势格则反之）<br/><br/>身强时<br/><br/>真的有才华【较能赚钱】，身强较会将读书所学之才华应用于生财之道。较能发挥实才。<br/><br/>食伤重<br/><br/>常因自负而断送财根，对自己过份自信，而难听他人意见。（若成为从儿格或从势格则反之）<br/><br/>食神在年柱<br/><br/>小时候很快乐，较会思考，头脑好，读书学习静的下来。聪明，学习力强，小时候很会读书，一出生就有得吃，家境不错，小时候体衰力弱，是父母亲最操心的小孩，父母是靠双手抵足奋斗的人，不靠祖业的人。你从小就聪明伶俐，善解人意，工作上不论文或武都可胜任。<br/><br/>食神在月柱<br/><br/>会研发及发明东西，交的朋友都不错，也很有才华，能运用头脑赚钱，较有食禄，适合文学及翻译人员，所交的朋友中，也易引来官司诉讼(逢官时) ，不喜用祖德，而想靠自己的双手独立赚钱。<br/><br/>食神在日柱<br/><br/>1. 藏干食神，配偶有才华，较喜乐，易发福。<br/>2. 配偶性格敦厚宽宏，夫妻间追逐互不拘束，配偶身材较丰厚。<br/>3. 自身行事缓慢，企划力强，但实践力弱。<br/>4. 女命如逢偏印克制易克损子息或生产时较不顺。<br/>5. 口才佳，感情重实质生活。<br/>6. 配偶较风流，注重性生活之协调。<br/><br/>食神在时柱<br/><br/>长寿，老年快乐 ( 食神 ) 肚量大，晚年较会吃素，女命注意流产。早出社会，容易付出，喜欢儿孙满堂，烦恼约只停留五分钟，男命为禄寿，女命为子息。<br/><br/>食神格局<br/><br/>会玩，心胸宽广不会发愁，不喜与人争。在哪个宫位，对应宫位的身体部位就大。身强为食神泄秀，表现为口才好、出口成章。食神过旺（食神多了变伤官），会有官司。食神过多会懒散、有拖延症、头脑简单。",
    "伤官":
    "日主所生者异性为伤官。代表思想，倾向于偏激，和食神相同的是，都是能说会到，食神平和，伤官偏激，伤官比食神灵活，有灵气。命中带有伤官性格易被感动、男英俊、女俏丽的特性(凡事惜情，重感情，过份感情用事)。<br/>缺少伤官，上进心不强。<br/><br/>优点<br/><br/>博学多能，多才多艺，活泼善辩，表达流畅，聪明足智，机灵敏锐，深谋远虑，领悟优异，创意丰富，理想高远，满腔抱负，活力充沛，斗志高昂，重视他人对自己之肯定，有不断超越他人之欲望，学习能力强。易成英雄人物，大都相貌清秀或博学多能。由于口才流利，表情丰富，故很适合往演艺、歌唱、舞蹈方面发展，也可以从事广播、新闻报导、节目主持人等利用口才之工作事业，并且对于艺术美学之感受敏锐，颇具灵性，因此也适合从事画家工作，或自由业、古董或精密技术方面发挥。<br/><br/>缺点<br/><br/>由于领悟学习能力优异，因此兴趣广泛，博而不精，不能量力而为，往往做出超越本身能力之事，而招致失败，由于领悟力强，博学多能，故往往养成恃才傲物，任性乖张，骄傲自大，一意孤行，无法接纳忠言，厌恶礼俗拘束，易倾向狂妄乖张，蔑视法令，为达目的，不择手段，或以私害公，伤人自尊，招来祸患，财多则贪得无餍，好管闲事。伤官好胜逞强，乖戾不驯，爱出风头，感情用事，主观强烈，做    事容易情绪化，招来许多误会。男性宜尽量克制私欲，女性宜注意修心养性，以免违反伦常，触犯法律。<br/><br/>代表事物<br/><br/>伤官代表头脑聪明、语言利快、智商优劣、音乐天赋、艺术才华、官灾官司、领导关系、男命女儿、女命儿子等。<br/><br/>伤官为用<br/><br/>活泼乐观、外向多情、博学多能、多才多艺、聪明足智、文笔超群、能言善辩、滔滔不决、男英俊潇洒、风流倜傥、女苗条端正、秀丽可爱。<br/><br/>伤官为忌<br/><br/>追求名利、爱出风头、持才傲物、个性偏激、自命不凡、夸夸其谈、好高务远、刚愎自用、桀傲不驯、逞强好胜.任性自由。<br/><br/>偏印伤官同现<br/><br/>独断又缺乏自信，常做了后悔，又不愿承认。会常恍惚，不知想什么，才华亦不稳定，重逻辑，表现欲强，理解力强，多学不专，急性喜自由，易感动，易受外在事物影响。<br/><br/>伤官多<br/><br/>伤官多要求有 2 个以上，血光、破财、官司、车关，一生灾难不断，骄傲自负，常因自负而断送财根。做事反反覆覆而不自知，破坏自己格局，看不得他人比自己好。易有精神病发现象，或导致配偶送精神病院。刚腹自用，学东西很快，学了就走，凡事学习力强，相对看不起学不会者。男生一生难有成就，女一生爱做、爱念、爱挑剔又是直肠子的人。<br/><br/>女子伤官比肩过重<br/><br/>比较容易从事八大行业，也较容易多愁善感。环境较差，处处须自己眼明手快打点。把自己的环境看得较悲哀，个性上比较不愿落人于后，所以比较敢冲。<br/><br/>带食神伤官者<br/><br/>做事默默的做，不要强出头，等人发现，一体两面，拿捏的很好。<br/><br/>伤官在年柱<br/><br/>与长上不易沟通，太岁如遇伤官，须特别注意灾难，父母感情有问题。有较悲伤的童年(身强)，幼时体弱多病(身弱)，家道逐渐走下坡，小时候爱出锋头，自卑感较重。<br/><br/>伤官在月柱<br/><br/>与兄弟姊妹较不亲近，思想奇异，气燥情烈，反应灵敏，反应好，点子多，易走极端(男命)。兄弟姊妹无助，不管家财多否，凡事喜欢【靠自己】；女命：夫妻相处感情较易发生问题。<br/><br/>伤官在日柱<br/><br/>1. 藏干带「伤」者，男命：夫妻间该多沟通。女命：丈夫龟毛，比丈夫凶。<br/>2. 配偶间易互相猜忌，男命事业心重，不易纳妻言，女命有凌驾丈夫之心态，易有婚变之兆，夫妻行事较难达成共识。<br/><br/>伤官在时柱<br/><br/>女孩子易流产，男孩子较不易得子，身强晚年不易与自己子女沟通。子孙较顽强难以教养，一有名声地位就会被伤害。易伤到子女，小孩愈大愈难教养或【教导】，有时候会没有下一代【易流产】，老年压力大，身体较不好，小时候是家中父母的麻烦，也是父母操心的对象。<br/><br/>伤官格局<br/><br/>官司口舌纷争比较多，上进心强，于天斗、与地斗、于人斗。喜欢和领导对着干，不服管教、个性独立、不喜欢被约束、爱装逼、聪明伶俐、杠精附体、喜欢抬杠、恩怨分明、有仇必报、不会道歉、死不认错。女命伤官多会骂丈夫。食神格、伤官格追求吃喝玩乐、性、享受生活。",
    "正财":
    "我克者异性为正财。其性格，为人正义，明辨是非，爱打抱不平，待人诚实，有负责任感，为人处事豪爽大方，礼貌热情，是个值得信赖的人，其人性格温顺，深谋远虑，处处小心谨慎，有时过于胆小怕事，做事脚踏实地，不虚伪，不狡诈，善于顾家守财，一生勤劳节俭，正才是正大光明，完全靠才能挣钱，或享受国家的俸禄，代表荣誉，代表财产财富。<br/>正财性格爱玩，有欢喜心，喜爱热闹，有异性缘，疼老婆，节俭，做事固定，赚钱机会多，有家庭责任，满足欲低，好沟通，闲不住，缺恒心的特性。，(男命) 喜成熟的女人，菩萨心肠，自己有时，也希望旁边的人拥有。<br/>天干有正财，偏财，而地支无库，一生财来财去，表面看似有，但内在未必有。正财多好沟通，会讲好话，且很有异性缘，有欢喜面。<br/>缺少正财，财来财去一场空，赚钱比较困难。<br/><br/>优点<br/><br/>为人节俭，重视信用，安分守己，量力而为，不贪非分，正直不阿，嫉恶如仇，不喜投机，不喜钻营，刻苦耐劳，任劳任怨，辛勤努力，按步就班，珍惜金钱，点滴致富，家庭观念浓厚，对妻儿尽责，知足    常乐，脚踏实地，保守中庸，不标新立异，不惹事生非，不出风头，不勾心斗角，目睹为信，不信邪魔歪道，重视物质生活，缺乏精神调剂。<br/><br/>缺点<br/><br/>由于重视物质追求，缺乏精神调节，以致精神空虚，所谓「家富心穷」。又贪图安逸，享受现成，好逸恶劳，苟且偷安之心态，常因过于计较金钱得失，被认为守财奴、吝啬鬼，除了对女性不吝其财之外，对家族亲友均斤斤计较，让人认为薄情寡义。做事过于守本分，谨慎过度，缺乏勇气与魄力去追求变化与突破，故其生平事业较平淡无奇，缺乏轰轰烈烈之表现与成就。做事保守，进取不足，缺乏耐心，往往虎头蛇尾，半途而废，斤斤计较，因小失大，单调刻板，憨厚有余，权通不足，不愿吃苦，欠缺责任心与荣誉感，容易流于怠惰之习惯。<br/><br/>代表事物<br/><br/>正财代表金钱、财富、薪水、固定资产、定期存款、房子、稳定股票、稳定工作。正财还代表长期工作的工资和收入，男命的妻子等。<br/><br/>正财为用者<br/><br/>适合商业贸易界、金融界、经济业、财政界、理财业、企业管理、财会、出纳、记帐等行业<br/><br/>男命正财<br/><br/>有两个正财者，有结两次婚的机会【会因离婚或丧偶】。八字无财，不疼老婆，就是疼也表达不出来。<br/><br/>正财在年柱<br/><br/>小时爱玩，不喜欢读书，家境好，有祖产，赚钱机会点多，且赚钱容易得祖产机率高，家里是妈妈掌管经济，考试很棒。身强：小时候伸手就有钱，家境不错。身弱：小时候家里缺钱，缺钱时长上可提供资源，或不断供应财源，甚至结婚后亦同。<br/><br/>正财在月柱<br/><br/>出社会爱赚钱，赚钱容易，也很容易满足，不喜欢念书，会半工半读。很早赚钱，但发挥力不足，反无法发挥其力道，(与现今社会快速跃动有接续不上之叹)。<br/><br/>正财在日柱<br/><br/>藏干正财，男命妻贤美多助，更易获妻财。女命丈夫具正财优缺点特性。<br/><br/>正财在时柱<br/><br/>老年喜爱游山玩水，不缺钱，较有钱，子女赚钱容易也很快，自己有积蓄，烦恼容易排除。身强：年纪大时有钱喜欢游玩，孩子收入、生活都不错。身弱：须时时追钱，但保守者不会，且会拥有固定资产。<br/><br/>正财格局<br/><br/>不愿冒险，追求稳定的收入，一般为打工者居多。钱来的不容易，说得好听叫勤俭节约，说得不好听就是比较抠门。诚信可靠、脚踏实地、重视家庭、爱妻子。但正财太多的男命容易多次结婚。",
    "偏财":
    "我克者同性为偏财。是我们能控制的任何具体事物和事件，但却不执着在这个事物上，偏财之财具有流转性，如交易，转让，投机，借贷，中介生意，咨询服务。<br/>【身强者】本命中带有偏财，不看重钱财，正常上班者易多角投资，钱来的快去的也快，善理财，赚钱比人快，流失也快，感情不专有困扰的特性，喜欢把一生当成赌注，看女人喜看妹妹，交际手手腕好。<br/>缺少偏财，勤俭节约，性格不够豪爽。<br/><br/>优点<br/><br/>慷慨豪迈，圆滑机智，精明干练，精力充沛，坦白诚实，淡泊名利，豪爽侠义，乐于助人，风流多情，做事干净俐落，速战速决，头脑灵活，乐观进取，不为艰难，举止轩昂，交际手腕灵巧，善于把握机会去赚取钱财。安排事物有条有理。凡事拿得起放得下，而且不过于执着于钱财。生涯中多机缘巧遇，因此常有意外收获。在金钱与女缘方面常有戏剧性的得失。<br/><br/>缺点<br/><br/>由于性格慷慨豪迈，不太珍惜金钱，以致奢侈浪费，一掷千金，毫不知惜，极易破败家业。又因喜欢逗留在外，钻营钱财。加上其圆滑机智之交际手腕且又出手大方，故容易赢得女人欢心或沉迷于酒色之中，以致挥霍家业而不知节制。感情不专，态度轻挑，玩世不恭，往往容易引起家庭革命，而影响家庭之安定性。由于对金钱不执着，以致开销也大，如果经营企业则应注意企业业绩之大起伏，尤其在凶运时更应注意，否则容易危及企业之生存安危。偏财为忌时，则会有诈欺之行为。<br/><br/><br/><br/>代表事物<br/><br/>偏财代表金钱、财富、长期工作工资以外的收入、横财、投机之财、意外之财、彩票、贿赂、拾物捡钱、当年新行业所赚的钱、父亲、男命情人等<br/><br/>偏财为用者<br/><br/>适合商业贸易界、金融界、经济业.财政界、理财业、企业管理、股市、期货、房地产开发、投资债券、自做事业、自做老板等行业、偏财为用，豪爽开朗、慷慨多情、风流重义、投机好赌。<br/><br/>偏财断句<br/><br/>1. 八字无正财、偏财，会不懂赚钱又吝啬，不会疼老婆。<br/>2. 男命偏财旺，易离婚，婚姻易不美。<br/>3. 女命正财旺，或偏财旺，喜欢赚钱，较喜欢不动产。<br/>4. 偏财多表不爱正妻只爱妾【需视环境】。<br/>5. 偏财不宜任大官，会玩股票或再从事其它投资。<br/><br/>偏财在年柱<br/><br/>祖产有，一生有好玩的，有好吃好用的，与父亲沟通不良，家境好，不喜欢念书。小时候就会作生意，想赚钱，较不喜欢读书，早期有赚钱，但守不住【曾经拥有过】有祖产，较贪玩，父亲会是您一生的目标榜样。对父亲有难以言喻的情怀，小时候是你很快乐的回忆。会将父亲当成你一生做事做人的标杆。<br/><br/>偏财在月柱<br/><br/>出社会很爱赚钱，做人易 ( 亲近 )，也易从事大票的金钱游戏，赚钱容易，不重视金钱。读书时边读边玩，出社会就很会赚钱，社交应酬一流，故钱易【留不住】，不重视钱财，天性好赌成性。<br/><br/>偏财在日柱<br/><br/>1. 藏干偏财，配偶具偏财之优缺点。<br/>2. 配偶精明能干锐利，行事爽快，不拘小节，男命有宠妾伤妻之倾向，女命之能力较夫贤能，不论男女命宜晚婚可免家庭风波。<br/><br/>偏财在时柱<br/><br/>老来富，赚钱能力比一般人强，越老越想赚钱。身强者为所有命盘赚钱最厉害的，可以有【大事业】，但须置不动产，否则因不重财，来得快去的也快，自己不要理财，交给专家。<br/><br/>偏财格局<br/><br/>整天想着做生意、干大事。老板居多，吃饭抢着付账，豪爽大方。赌性大、觉得人生不过一场赌，投资喜欢一把梭哈，赌输了大不了从头再来。锄强扶弱、大侠性格、喜欢交朋友、喜欢请人吃饭、艳遇多、但收入不稳定，时有时无。一心多用，同时做几件事情。正财格、偏财格追求财富，男人喜欢追求女人。",
    "正官":
    "克日主之异性五行为正官。正官是护身卫财之本，表示保护人身及财产的安全，正官象征着官方权力，多受法理的约束。<br/>【身强者】本命中带有正官性格光明正大的心态，但不积极，为人爱面子，是人人心中的好朋友的特性。<br/>缺少正官，不喜欢别人约束，目无法纪，我行我素，不能严格要求自己。<br/><br/>优点<br/><br/>为人品行端正，光明磊落，正直保守，心地善良，秉公尚义，知理守法，负责重信，热心服务，安分守己，不贪非分，重视纪律规范，做事认真负责，待人处事，客观理性，有识人之眼光，具管理之能力，重视精神生活，乐于服务人群，严以律己，宽以待人，深得信任与尊敬。<br/><br/>缺点<br/><br/>做事按步就班，一板一眼，循序渐进，事多牵挂，瞻前顾后，刻板谨慎，缺乏积极，墨守成规，缺乏变巧，魄力不足，优柔寡断，往往临事犹豫以致错失良机。<br/><br/>代表事物<br/><br/>正官代表一生有无官命、官职大小、工作事业、领导上级、老板上司、主管师长、升学出国、官克官灾、官司口舌、地位名誉、考试晋级、乡俗规范、规章制度、法律秩序、常规正统、女命丈夫等。<br/><br/>正官为用<br/><br/>用神旺，天干透出有助地支有根逢生，级别高权力大。事业有成之命，必为政府官员。<br/><br/>正官为忌<br/><br/>忌神旺，天干透出有助地支有根逢生，有官灾进牢狱，一事无成。<br/><br/>正官断句<br/><br/>1. 女命正官出现在年或月柱：早婚机率高且早熟，疼老公，碍于好面子，故纵使不好，也绝口不提，甚至不喜人说他任何不好。<br/>2. 命带正官和比肩：不可为朋友做担保人，一生注意官非诉讼。<br/>3. 女命【身弱】带正官和七杀：一生感情纠缠不断，为情所困；【身强】懂得运用，有帮夫运，懂得运用人际桃花。<br/><br/>正官在年柱<br/><br/>家教严【好】，小时候爱哭，考运好，小时候很认真读书，家境好。小时候家教很好，常是班上的干部。荫父母【赚钱、发财】，女孩子的男朋友早出现(易有恋父情结)。<br/><br/>正官在月柱<br/><br/>别人心目中的好朋友，出社会名声地位往上扬。身强：读书运好，考运好，会交到好朋友，讲话会被肯定。读书时常拿奖状，名声地位好。身弱：出社会为了有好名声，找工作只想找好看的工作，女人常为男人而身累俱疲。<br/><br/>正官在日柱<br/><br/>1. 藏干正官，反应力极佳，太太端庄高贵，中年大发。<br/>2. 配偶易为公教人员或主管级，性格率直，不擅掩饰，生活方式较单调。<br/>3. 夫妻彼此较重视精神感受及生活之协调。<br/><br/>正官在时柱<br/><br/>1. 老来名声好，小孩能力好，部属很棒，男重地位。<br/>2. 身强年纪大时，名声地位好，儿女都有成就，名气响。<br/>3. 身弱则压力大，常被儿女压得透不过气来(儿女如父母)。<br/><br/>正官格局<br/><br/>一身正气、光明磊落、容易当领导、老大、领袖。对自己严格要求、交朋友做减法，有恶习之人不交。厚道、认真、过于严肃、强迫症、古板、爱操心、劳累。说话多以命令的口气，不爱与人商量。",
    "七杀":
    "克日主之同性五行为七杀。命中偏官有制化叫偏官，无制化，叫七杀。本命中带有七杀性格积极，不是懦夫的特性。七杀与日柱是同性之克，无情之克，其含义为打击，压制，暴力，权威，其性刚雄，具有叛逆，称霸之性，需制化方可驾驭。<br/>缺少七杀，做事不够心狠手辣，执行力差。<br/><br/>优点<br/><br/>为人威严有权，智略明敏，志大进取，勇敢果断，抑强扶弱，嫉恶如仇，斗志昂扬，见义勇为，光明正直，不善虚伪，具优秀之直觉判断力，勇于突破环境，开创新机。明察秋毫，绵密细致，运筹帷幄，善于策划，具领导权威，能得部属及子女之敬畏。<br/><br/>缺点<br/><br/>谋事采取竞争手段，因此十分费力，个性刚倔，有时过于偏激，使别人难以接纳，造成怨言，甚或树敌招恨，常因不满现状而欲突破创新，以致带来人生波动，有时陷入困境，孤苦无援。多年友情也常因一时之冲动鲁莽而失去友谊．偏官过旺时容易变成阴沉好杀之性，争强好胜，猜忌多疑，不太信任他人，以致孤军奋斗，事倍功半备极辛劳。<br/><br/>代表事物<br/><br/>七杀又称偏官，代表军人、警察、法官、检查官、武术运动、军械刀枪；代表伶俐矫健，法律、黑社会、意外灾难，车祸就看七杀的吉凶，女命的情人。<br/><br/>七杀为用<br/><br/>机制勇敢，果断威猛，意志坚强，敢做敢为，不怕困难，尽职尽责，积极向上，战斗英雄，刑警队长，代表正义。<br/><br/>七杀为忌<br/><br/>愚顽鲁莽，凶恶残暴，执着偏激，破坏叛逆，专制自私，狠毒顽固，绿林盗匪，.乱世枭雄，黑恶势力，代表邪恶。<br/><br/>七杀断句<br/><br/>女命带正官和七杀：异性缘好【容易与男人发生性关系】。报复心强，天干做事喜直接，地支做事善耍阴谋，做事喜明来又暗做，不喜表露心事，阴沉神秘，异性缘较乱。<br/>女命身强带七杀：玩弄男人在掌心【有操控权】，敢爱敢恨。<br/>女性七杀多：看人眼睛尾易勾魂，喜侧眼看人，应该多理性思考，思想较正确，才不会被人觉得很恰。<br/>命带七杀【身强用】：果断力强，敢爱敢恨，阿莎力，凶狠气躁，专制霸道，积极，公关能力强。报复心强，有仇必报，但会选时机。<br/>身强带七杀：公关第一，有帮夫运，不碰没事，一碰家事就会有破坏的东西。<br/>身弱带七杀：易遭意外，做事较不积极，常遭血光。<br/>八字无正官及七杀：说话不重不威，没人听的下去，女性不疼丈夫，男性难以出头。<br/>命带七杀：敢爱敢恨，受欺负委屈永远记得，记恨难忘记，出生时父母见血光刀伤。<br/><br/>七杀在年柱<br/><br/>女孩子易不小心而失身，小时候身体不好，较难教育或养育，不听话，家教甚严，管教方式为打、骂；身上脸上易带疤痕【身强不会】，小时候不好带，易有灾难，爬高爬低。<br/><br/>七杀在月柱<br/><br/>身体不好【身弱】，出社会名声地位往上爬 【身强】，出门有多少就花多少。<br/><br/>七杀在日柱<br/><br/>1. 藏干有「杀」者，配偶多半个性刚毅、暴躁。但身强者较好些。逢支合就不明显，逢支冲就相当的明显。<br/>2. 配偶精明能干，豪放，善外交，个性急躁，刚烈，倔强。易体弱多病，且责任压力皆重。<br/><br/>七杀在时柱<br/><br/>1. 事业常常会因有突来意外，而抹杀掉先前的投入，太急不易成功。<br/>2. 孩子不易照顾，须操烦小孩，老年爱漂亮，女命老年仍有人追求，子女难教养，生意人常烦恼事业，压力沉重。<br/>3. 喜欢打骂孩子，儿女好动，不易管教，常惹事生非。<br/>4. 人生到老还在追逐舞台，一生难以放下名与舞台。<br/><br/>七杀格局<br/><br/>病神，喜欢做二把手。心狠手辣、胆子大、聪明伶俐、执行能力强、嫉恶如仇、性格火爆、翻脸如翻书。鲁莽暴躁。代表女命之情人。正官格、七杀格一生追求：名声地位，女命会有很多追求者。",
    "正印":
    "生扶日主的异性五行为正印。正印慈悲心肠，富于浓厚的人情味儿，待人重情重义，思考力丰富，聪明多智慧，内涵不露，有随机应变的能力，常能谋大事，吸取知识，有精气神，正识正见，是生扶本身（日主）的吉星。本命中带有正印性格是权力，慈悲，心软的特性 ( 像哲学家、文艺家 )。<br/>缺少正印，记忆力不好。<br/><br/>优点<br/><br/>正印之人气质优雅，智慧聪颖，宽容善良，仁慈敏慧，不计仇恨，重视学问之充实，品德之修养，与精神之调剂。清高自负，自远小人，自励自爱，方正亲切，重人情，爱面子，信仰宗教，先知先觉，易得名声，易掌权贵，常得贵人之提拔，能享现成之福气。<br/><br/>缺点<br/><br/>由于重视精神生活，往往会自视清高而轻视金钱，本性木讷而不善营谋，虽有先知先觉之智慧，却会容易脱离现实，不切实际，缺乏应变能力，且不善于察言观色，不善于勾心斗角，也不愿同流合污，但又爱面子而打肿脸充胖子，会掩饰自己的过失，严重时甚至虚伪欺诈，以致触犯法网。<br/><br/>代表事物<br/><br/>正印代表文凭、法律文件、学生理科的成绩、当官有无实权（印可以护官）、车船、飞机、长辈、母亲、房屋、衣服、雨具、田宅不动产、文化学业、文书图书、职称荣誉、责任权力、一切滋助养育关怀爱护我的人和物都看正印。<br/><br/>正印为用<br/><br/>爱正向思维，适合教育界、出版业、文学艺术界、美术设计、学术研究等行业。<br/><br/>正印断句<br/><br/>男命命带正财和偏印：此生较会有婆媳间的问题，最好婚后婆媳间应多多沟通。<br/>带正印者：为人较正派做事较确实，所以会惹人疼爱，尤其身弱者。小时候特别受父母宠爱，易得到财产机会较大。祖德甚好，小时候长辈较会带往宗教的地方参予活动，身强印多，一生压力重重，难解烦闷。<br/>命带正印和偏印：为人心性不定，优柔寡断，不易相信人。<br/><br/>正印在年柱<br/><br/>女命正印克食伤。印太多不容易有子息。祖产、地产有，但不一定值钱，大多家族由女大人主管着，为人孝顺父母。<br/><br/>正印在月柱<br/><br/>表在社会中较常会接触到宗教的人，喜欢到宗教场所，贵人多。<br/><br/>正印在日柱<br/><br/>1. 藏干为印者，配偶品格气质佳，且为人厚道，斯文有理。<br/><br/>2. 配偶工作易属文职，婚姻生活上盼望得到配偶之呵护照顾，配偶性格稳重踏实，年纪较己为大。<br/><br/>正印在时柱<br/><br/>表年纪大时想静、想修，晚年想修道，易接触宗教环境，皈依或出家或吃素，喜爱安静，老年易得老人痴呆症。<br/><br/>正印格局<br/><br/>热爱学习、心地善良、重情重义、有艺术细胞、一生没有大灾大难，一生多贵人相助。",
    "偏印":
    "生扶日主的同性五行为偏印。【身弱用】本命中带有偏印性格是爱插嘴，点子多，反应快，【道、密宗】较不易赞同别人的想法的特性。<br/>缺少偏印，分析能力差。<br/><br/>优点<br/><br/>思考细腻，机灵灵敏，感觉敏锐，善于临机应变，具优秀之领悟能力，观察入微，老练能干，警觉性高且能保守秘密，喜怒哀乐不形于色，能让异性信赖，对于企划、创造、设计方面，具有独特之见解，思想高超怪异，擅长怪招奇术。<br/><br/>缺点<br/><br/>思想超凡怪异，性格内向多疑，喜离群独处，不喜参与社交活动，常有厌恶世俗之心，虽有斗志却耐心不足，做事往往三心二意，以致东不成西不就，虽好学艺却少有成就，思想奇特，标新立异，喜走捷径，不能按步就班，喜求旁门左道，往往无事空忙。偏印过重则利己心强烈，过高评价自我，以致难与人和睦相处，令人有孤僻之感。<br/><br/>代表事物<br/><br/>偏印又称枭神，代表名声好坏、表扬批评、学生文科的成绩、宗教事业、玄学五术、民间医术、边缘学科、精神思维、、虚病癔病、买房建房、买车买船等都看偏印。<br/><br/>偏印为用<br/><br/>偏印为用神的人爱逆向思维适合的 行业，佛学、道学、灵学、哲学、宗教、卜筮、命相、地理。偏印也可以从事创造发明设计研究、调查侦训、写作著书。<br/><br/>偏印断句<br/><br/>偏印和伤官同现，突然间会常恍惚不知想什么，需座禅来调适。<br/>两个偏印，食古不化，好胜心强，好辩，爱好革新，喜夺权，为反对而反对。<br/>偏印多三个以上，身体会不好。容易成为神明的乩童。<br/>正印和偏印，一辈子后知后觉，非常主观，同时出现主观跟同化，心性不定，三心两意，反而不易成功，话多，意见都是自己的对，左说右说都是他对。<br/>命带偏印【身弱用】，爱插嘴，点子多，反应快，较不易赞同别人的想法，冷漠，叛逆性强，是洗脑专家。爱问又听不进别人说的，爱问，但问题未回答完，新的问题就已出笼，喜钻牛角尖，说话一闪失，就容易挖疮抓包。<br/>女命两个偏印以上且在时柱，不易有子息，晚年子宫、膀胱易切除，又晚年孤僻难相处，会选无尾巷的房子住。<br/>八字无正印及偏印，表示没主见及不主观，易受人左右，内心较没安全感。<br/><br/>偏印在年柱<br/><br/>父亲外遇机率大，母亲受伤害机率高，易给神明当养子。表小时候大多较难养，吃人水米长大【给人当儿子】，出生时大多父亲不在身边，祖母溺爱父亲，以致母亲反受其害。<br/><br/>偏印在月柱<br/><br/>爱唱反调，出社会贵人多【身弱时】，【身强】则会犯小人。身强表假贵人，出社会朋友常会讲好听的话，为了好听话，常会破财亏钱。常被身边最亲近的人所害。<br/><br/>偏印在日柱<br/><br/>1. 藏干为者，有晚婚之倾向。<br/>2. 身强者配偶多半难言佳美。感情婚姻多波折，因对配偶之要求及期望过高，如结婚将会任何权力皆由配偶掌管，对配偶较依赖。<br/>3. 女命婚后易有婆媳问题，且家中事物由婆婆掌理，以职业妇女为佳。<br/><br/>偏印在时柱<br/><br/>赚钱辛苦，犯小人【身强】喜安静，比较会心烦，愈老愈固执。<br/><br/>偏印格局<br/><br/>心细如发、有专业技能、一技傍身、忧愁抑郁、多疑、不信任别人。能看到别人看不到的细节，第六感强、敏感。适合做军师、参谋。脑子不停的思考。正印格、偏印格追求思想、文化、信仰。"

};

var HELP_12SHEN_INFO = {
    "太岁":
        "太岁运年多忧愁，口舌临门不自由<br/>" +
        "疾病缠身小人侵，婚姻钱财莫强求<br/>" +
        "运犯太岁难行舟，劝君持重莫远游<br/><br/>" +
        "【解释】：<br/>太岁押运不是福就是祸，是福无限美，是祸多忧愁。太岁押运起祸端，伤财惹气心不甘。惊天动地祸来临，现是现非把人缠。他人闲事莫得管，防备自己得安然。太岁为中性星，遇吉则吉，遇凶则凶。四柱、胎元、身命两宫及大运、流年无论见吉星还是见凶星，只要太岁落在地支上即以凶论。 <br/>"+
        "【疾病】：<br/>脑部疾病、脾胃疾病、皮肤疾病。<br/>"+
        "【五行】：<br/>土<br/>"+
        "【性格】：<br/>稳重老练，城府较深<br/>"+
        "【组合象义】：<br/>"+
        "太岁/青龙：工作事业有利，上司赏识、提拔<br/>"+
        "太岁/丧吊：太岁为工作事业，配凶神，丧吊为倒霉等事<br/>"+
        "太岁/六合：工作事业得力，官方合作，有异性缘，<br/>"+
        "太岁/官符：升迁、共作调度、事业顺利<br/>"+
        "太岁/大小耗：为工作、事业损失破财、被罚款、仕途不顺<br/>"+
        "太岁/朱雀：工作事业中有口舌官司、为上司担过，被诬陷<br/>"+
        "太岁/白虎：工作事业破败，公司倒闭、破产、仕途阻隔<br/>"+
        "太岁/贵神：工作事业得贵人相助，政府支持<br/>"+
        "太岁/病符：工作事业上有忧愁、忧虑担心，烦心事多<br/>",
    "青龙":
        "青龙入命大吉祥，创业谋事有人帮<br/>" +
        "添人进口生贵子，家中喜事一桩桩<br/>" +
        "官运亨通财运好，即使有祸不为殃<br/><br/>" +
        "【解释】：<br/>事业星、发财星、婚姻星。文凭星。青龙是喜神，大喜有几重。荷花生贵子，门前应挂红。青龙是吉星，旺为吉，见吉星为吉。如果被凶星盖头则凶，被中性星盖头亦吉。 <br/>"+
        "【疾病】：<br/>神经系统、四肢、酒色病。<br/>"+
        "【五行】：<br/>木<br/>"+
        "【性格】：<br/>仁慈善良，温和亲善<br/>"+
        "【组合象义】：<br/>"+
        "青龙/太岁：走动中见贵，文印不利，引起工作上的麻烦、口舌官司、被降职<br/>"+
        "青龙/青龙：重重见喜，学业有成，走动多，升迁、顺利<br/>"+
        "青龙/丧吊：文印方面引起纠纷，乐极生悲，喜事变丧事<br/>"+
        "青龙/六合：合作发财，文印方面进利，结婚得子，桃花年<br/>"+
        "青龙/官符：文引上有成就，有名气，途中见贵，<br/>"+
        "青龙/大小耗：文印方面破财，花钱买文凭，因喜庆事而破财<br/>"+
        "青龙/朱雀：文书、变动、走动方面引起口舌官司、乐极生悲，酒色生灾<br/>"+
        "青龙/白虎：文书、变动、走动方面引起争斗、血光，车祸、道路、伤灾<br/>"+
        "青龙/贵神：文印事业中见贵，得助，走动中见贵等<br/>"+
        "青龙/病符：酒色成病，神经有病，文印、事业、财利上忧愁",
    "丧门":
        "丧门运年心不安，求财望喜多枉然<br/>" +
        "不是伤人就损财，忧思重重整一年<br/>" +
        "没有内孝有外孝，犯着丧门泪涟涟<br/><br/>" +
        "【解释】：<br/>命硬星。丧门是哭神，落泪有几行。丧门是小凶星，弱为吉，空亡为吉，如果被吉星盖头则应小凶。 <br/>"+
        "【疾病】：<br/>脾胃消化系统。<br/>"+
        "【五行】：<br/>土<br/>"+
        "【性格】：<br/>倔强固执，木纳小性<br/>"+
        "【组合象义】：<br/>"+
        "丧门/太岁：犯官非，牢狱、不顺等<br/>"+
        "丧门/青龙：外出走动，纠纷，不顺，文印方面不顺，死人等<br/>"+
        "丧门/丧吊：主死人、官司、纠纷<br/>"+
        "丧门/六合：不利合作，财运不济，感情纠纷<br/>"+
        "丧门/官符：工作事业不利，牢狱、官非<br/>"+
        "丧门/大小耗：死人、破财、破败<br/>"+
        "丧门/朱雀：官非争斗、因死人而引起官非<br/>"+
        "丧门/白虎：死人、血光、牢狱、宫非<br/>"+
        "丧门/费神：工作事业无助、反招小人，求官、求贵中创播、降职<br/>"+
        "丧门/病符：病死，丧葬，得病",
    "六合":
        "六合入命大吉昌，万事顺遂人丁旺<br/>" +
        "多得亲友来扶助，纵有逆风不起浪<br/>" +
        "求财牟利皆如意，添喜进财时运强<br/><br/>" +
        "【解释】：<br/>发财星、事业星、婚姻星。文凭星。六合为吉星。六合见六合，必定喜事逢。有妻生贵子，无妻娶娇娥。 <br/>"+
        "【疾病】：<br/>花柳病、眼睛疾病、肾病。<br/>"+
        "【五行】：<br/>木<br/>"+
        "【性格】：<br/>善于交际，与人合和<br/>"+
        "【组合象义】：<br/>"+
        "六合/太岁：合作犯官非，感情起风波，财上见官非<br/>"+
        "六合/青龙：合作见喜，财运旺，婚庆、喜庆，学业文印有利，得财<br/>"+
        "六合/丧吊：合作纠纷，感情纠纷，破财<br/>"+
        "六合/六合：合作发财，添人进口，感情好，顺利，中奖，股票获利等<br/>"+
        "六合/官符：工作事业得利，合作有利<br/>"+
        "六合/大小耗：文印方面破财，花钱买文凭，因喜庆事而破财<br/>"+
        "六合/朱雀：因合作犯口舌、感情纠纷<br/>"+
        "六合/白虎：因感情、合作而生争斗<br/>"+
        "六合/贵神：合作中遇贵人相助，得财、旺财<br/>"+
        "六合/病符：酒色成灾，合作不顺，感情烦恼",
    "官符":
        "官符入命令人愁，是非口舌无止休<br/>" +
        "平地也会起风波，忧思如麻不断头<br/>" +
        "财帛易散物易损，犯了官符不自由<br/><br/>" +
        "【解释】：<br/>事业星、女性的婚姻星。官符为中性星。官符为红鸾，有喜在当年。少惹是非事，免祸在身边。 <br/>"+
        "【疾病】：<br/>脾胃消化系统。<br/>"+
        "【五行】：<br/>土<br/>"+
        "【性格】：<br/>高贵典雅，有风度气质<br/>"+
        "【组合象义】：<br/>"+
        "官符/太岁：工作、事业有纷争、降职官非<br/>"+
        "官符/青龙：工作、事业、仕途通达，得财、掌权、为官得印、升迁<br/>"+
        "官符/丧吊：工作事业不顺，倒霉、纠纷、官司口舌<br/>"+
        "官符/六合：财运旺或异性缘、感情<br/>"+
        "官符/官符：官运恒通、事业发展、女人则主结婚或异性缘、感情<br/>"+
        "官符/大小耗：花钱买官、仕途破财<br/>"+
        "官符/朱雀：工作、事业上起争执，官司口舌，被诬陷，为别人顶罪<br/>"+
        "官符/白虎：工作事业中有官非、争斗、或因工作而受伤<br/>" +
        "官符/贵神：工作事业有利，得领导提拔、升职<br/>"+
        "官符/病符：工作、事业不顺，因工作而病，忧愁、烦恼",
    "小耗":
        "小耗之年多烦恼，是非口舌不厌休<br/>" +
        "官非易起气易惹，金银钱财有损耗<br/>" +
        "东奔西跑无定处，办事不遂多阻挠<br/><br/>" +
        "【解释】：<br/>破财星。小耗为小凶星。时运逢小耗，做事多颠倒。金银多耗散，家财招鬼盗。 <br/>"+
        "【疾病】：<br/>经络、小肠。<br/>"+
        "【五行】：<br/>水<br/>"+
        "【性格】：<br/>心急性直，不善于理财<br/>"+
        "【组合象义】：<br/>"+
        "小耗/太岁：死人、破财、经济纠纷<br/>"+
        "小耗/青龙：买文凭、破财、为异性而破财，因酒色而破财<br/>"+
        "小耗/丧吊：死人、纠纷、破财、官司<br/>"+
        "小耗/六合：合作破财、感情不利<br/>"+
        "小耗/官符：因工作、事业、官司等破财<br/>"+
        "小耗/大小耗：死人、大破财、大哭之像<br/>"+
        "小耗/朱雀：口舌、是非、破败，经济官司，破财，被诬陷、被劫<br/>"+
        "小耗/白虎：车祸、破财、血光、意外交通事故破财等<br/>"+
        "小耗/贵神：为贵人而破财，因工作事业而破财<br/>"+
        "小耗/病符：因病而破财，为钱而病",
    "大耗":
        "岁逢大耗祸非轻，官司盗骗极易生<br/>" +
        "不是破财遭凶事，就是体弱身多病<br/>" +
        "若遇白虎连一起，凶丧孝服灾更重<br/><br/>" +
        "【解释】：<br/>破财星、命硬星、旺气时为血光星。大耗为大凶星。大耗定不祥，父母有丁伤。今年财要损，朋友来反目。背后有人伤，落井会下石。 <br/>"+
        "【疾病】：<br/>大肠、盲肠。<br/>"+
        "【五行】：<br/>火<br/>"+
        "【性格】：<br/>粗暴豪爽，打抱不平<br/>"+
        "【组合象义】：<br/>"+
        "大耗/太岁：死人、破财、经济纠纷<br/>"+
        "大耗/青龙：买文凭、破财、为异性而破财，因酒色而破财<br/>"+
        "大耗/丧吊：死人、纠纷、破财、官司<br/>"+
        "大耗/六合：合作破财、感情不利<br/>"+
        "大耗/官符：因工作、事业、官司等破财<br/>"+
        "大耗/大小耗：死人、大破财、大哭之像<br/>"+
        "大耗/朱雀：口舌、是非、破败，经济官司，破财，被诬陷、被劫<br/>"+
        "大耗/白虎：车祸、破财、血光、意外交通事故破财等<br/>"+
        "大耗/贵神：为贵人而破财，因工作事业而破财<br/>"+
        "大耗/病符：因病而破财，为钱而病",
    "朱雀":
        "朱雀入命口舌生，招引祸害亦不轻<br/>" +
        "求名求财皆不利，风波扰得心不宁<br/>" +
        "若得吉星当头照，逢凶化吉保太平<br/><br/>" +
        "【解释】：<br/>官灾星。朱雀为大凶星。朱雀押运凶，口舌是非多。内外来磨磋，小人当前横。事事犯罗嗦。有理无人理，有冤无处诉，还要背黑锅。 <br/>"+
        "【疾病】：<br/>眼睛疾病、心脏疾病。<br/>"+
        "【五行】：<br/>火<br/>"+
        "【性格】：<br/>直来直去，语言得罪人<br/>"+
        "【组合象义】：<br/>"+
        "朱雀/太岁：牢狱、官司、纠纷<br/>"+
        "朱雀/青龙：文印、走动、旅途、变动而犯官非，<br/>"+
        "朱雀/丧吊：牢狱、官司、纠纷<br/>"+
        "朱雀/六合：合作、经济纠纷，异性缘合解<br/>"+
        "朱雀/官符：牢狱、官司、工作事业纠纷<br/>"+
        "朱雀/大小耗：打官司、破财、口舌<br/>"+
        "朱雀/朱雀：口舌、官司不断，因口舌引起官司<br/>"+
        "朱雀/白虎：因争斗、血光、车祸等意外之事打官司<br/>"+
        "朱雀/贵神：工作事业惹口舌官司、背黑锅、因贵人引起口舌官司<br/>"+
        "朱雀/病符：为口舌官司而忧虑或医疗纠纷",
    "白虎":
        "白虎入命最凶险，血光伤灾度难关<br/>" +
        "更有内外孝服事，天灾横祸需防范<br/>" +
        "白虎之年心不安，一年四季不消闲<br/><br/>" +
        "【解释】：<br/>官灾星。命硬星、血光星、弱气时为疾病星。白虎当头坐，无灾也有祸。铁罗汉落井，有力难施展。白虎下山来，又遭口舌运，又遭凶灾气。白虎为大凶星，不可被任何星盖头，盖头必凶。 <br/>"+
        "【疾病】：<br/>骨质疾病、血液疾病。<br/>"+
        "【五行】：<br/>金<br/>"+
        "【性格】：<br/>暴躁急性，惹是生非<br/>"+
        "【组合象义】：<br/>"+
        "白虎/太岁：牢狱、意外之灾，官非血光<br/>"+
        "白虎/青龙：打斗，争斗，交通事故<br/>"+
        "白虎/丧吊：死人、意外伤亡<br/>"+
        "白虎/六合：合作中产生争斗，因异性而争斗。因财而斗<br/>"+
        "白虎/官符：为意外事故打官司、官灾<br/>"+
        "白虎/大小耗：打斗、伤灾、血光之事、车祸而破财<br/>"+
        "白虎/朱雀：打斗、伤灾、血光之灾，口舌是非、官司<br/>"+
        "白虎/白虎：意外伤灾不断，车祸血光之灾<br/>"+
        "白虎/贵神：因贵人而打斗伤灾<br/>"+
        "白虎/病符：筋骨、血液之病、因斗伤而病，意外引起疾病",
    "贵神":
        "贵神入命福寿长，财运畅通身安康<br/>" +
        "善与人郊受人敬，高官厚禄名远扬<br/>" +
        "凡事都有贵人助，运逢贵神心欢畅<br/><br/>" +
        "【解释】：<br/>发财星、事业星。贵神为吉星。贵神押运事吉祥，财源广进喜又和。春不见喜秋也见，财喜双全不用说。男遇贵神天赐祥，女见贵神喜事多。 <br/>"+
        "【疾病】：<br/>脾胃消化系统、神经系统。<br/>"+
        "【五行】：<br/>土<br/>"+
        "【性格】：<br/>雍容华贵，慈眉善目<br/>"+
        "【组合象义】：<br/>"+
        "贵神/太岁：工作事业不顺，官非<br/>"+
        "贵神/青龙：财气，喜庆，事业走动、变动，遇贵人相扶<br/>"+
        "贵神/丧吊：求贵不顺，丧气，花销，哭，有小人<br/>"+
        "贵神/六合：因贵人而得财，合作遇贵，与贵人合作<br/>"+
        "贵神/官符：升职，仕途遇贵人扶助，事业通达<br/>"+
        "贵神/大小耗：因贵人破财，因事业破财<br/>"+
        "贵神/朱雀：贵人有官非，贵人变小人，官非口舌中遇贵人<br/>"+
        "贵神/白虎：贵人有车祸血光之灾，或自己伤病灾中遇贵人<br/>"+
        "贵神/贵神：工作事业顺利、得财<br/>"+
        "贵神/病符：疾病、忧愁中遇贵，贵人忧愁、烦恼",
    "吊客":
        "吊客流年必有凶，需防亲人不太平<br/>" +
        "没有内孝有外孝，晦气定有几多重<br/>" +
        "岁逢吊客心不安，旧愁去了新愁添<br/><br/>" +
        "【解释】：<br/>命硬星。吊客为小凶星。吊客押运事有凶，即有是非闹灾行。男犯吊客主不顺，女犯吊客有灾星。 <br/>"+
        "【疾病】：<br/>肺部。<br/>"+
        "【五行】：<br/>金<br/>"+
        "【性格】：<br/>忧郁寡断，心事重重<br/>"+
        "【组合象义】：<br/>"+
        "吊客/太岁：犯官非，牢狱、不顺等<br/>"+
        "吊客/青龙：外出走动，纠纷，不顺，文印方面不顺，死人等<br/>"+
        "吊客/丧吊：主死人、官司、纠纷<br/>"+
        "吊客/六合：不利合作，财运不济，感情纠纷<br/>"+
        "吊客/官符：工作事业不利，牢狱、官非<br/>"+
        "吊客/大小耗：死人、破财、破败<br/>"+
        "吊客/朱雀：官非争斗、因死人而引起官非<br/>"+
        "吊客/白虎：死人、血光、牢狱、宫非<br/>"+
        "吊客/费神：工作事业无助、反招小人，求官、求贵中创播、降职<br/>"+
        "吊客/病符：病死，丧葬，得病",
    "病符":
        "病符入命厄重重，疾病缠身家不宁<br/>" +
        "办事处处心不顺，朝朝暮暮愁云生<br/>" +
        "凭你是个硬身汉，也得脱上皮几层<br/><br/>" +
        "【解释】：<br/>疾病星。病符为小凶星。病符押运很难强，事要三思免祸殃。病魔缠身把人扰，三灾八难难得躲。 <br/>"+
        "【疾病】：<br/>肾病、肝胆疾病。<br/>"+
        "【五行】：<br/>水<br/>"+
        "【性格】：<br/>无病呻吟，惜力悲伤<br/>"+
        "【组合象义】：<br/>"+
        "病符/太岁：因官非而得病，忧愁、官司，因上司而优愁、烦恼<br/>"+
        "病符/青龙：酒色成疾，水土不服，文书印财、喜庆之事出毛病<br/>"+
        "病符/丧吊：因纠纷、背黑锅、倒霉而生病忧<br/>"+
        "病符/六合：为财而病，为孩子而病，忧愁、花柳之病<br/>"+
        "病符/官符：为纠纷、官司而病，因工作事业而病<br/>"+
        "病符/大小耗：痨病、因破财而病<br/>"+
        "病符/朱雀：因口舌、官司致病，忧愁、烦恼<br/>"+
        "病符/白虎：伤灾住院，血液病，手术，打斗而病<br/>"+
        "病符/贵神：忧郁成疾，求助无缘<br/>"+
        "病符/病符：病上加病，病重",
};

var HELP_12SHEN_CHANGE = {
    "变化规律": "● 太岁/官符 → 朱雀 → 贵神 → 丧门/吊客 → 官符<br/>" + 
                "● 青龙 ↔ 白虎互变；大耗/小耗 ↔ 六合互变<br/>" +
                "● 病符 → 无病",
    "变化条件": "● 属于财官食伤<br/>"+
                "● 或遇到：<br/>"+
                "　○ 空亡<br/>"+
                "　○ 刑冲穿绝<br/>"+
                "　○ 墓<br/>"+
                "● 印比合默认不变（除非空亡）"
}

var SHISHEN_MAP = [
    [ "日/干", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" ],
    [ "甲", "比肩", "劫财", "食神", "伤官", "偏财", "正财", "七杀", "正官", "偏印", "正印" ],
    [ "乙", "劫财", "比肩", "伤官", "食神", "正财", "偏财", "正官", "七杀", "正印", "偏印" ],
    [ "丙", "偏印", "正印", "比肩", "劫财", "食神", "伤官", "偏财", "正财", "七杀", "正官" ],
    [ "丁", "正印", "偏印", "劫财", "比肩", "伤官", "食神", "正财", "偏财", "正官", "七杀" ],
    [ "戊", "七杀", "正官", "偏印", "正印", "比肩", "劫财", "食神", "伤官", "偏财", "正财" ],
    [ "己", "正官", "七杀", "正印", "偏印", "劫财", "比肩", "伤官", "食神", "正财", "偏财" ],
    [ "庚", "偏财", "正财", "七杀", "正官", "偏印", "正印", "比肩", "劫财", "食神", "伤官" ],
    [ "辛", "正财", "偏财", "正官", "七杀", "正印", "偏印", "劫财", "比肩", "伤官", "食神" ],
    [ "壬", "食神", "伤官", "偏财", "正财", "七杀", "正官", "偏印", "正印", "比肩", "劫财" ],
    [ "癸", "伤官", "食神", "正财", "偏财", "正官", "七杀", "正印", "偏印", "劫财", "比肩" ] ];

var SHISHEN = ["比肩", "劫财", "食神", "伤官", "偏财", "正财", "七杀", "正官", "偏印", "正印"];
var SHSH = ["比", "劫", "食", "伤", "才", "财", "杀", "官", "枭", "印"];

var WXSHISHENG_MAP = [
    ["元", "金",    "水",  "木",   "火",  "土"],
    ["金", "比劫",  "印星", "官杀", "财星", "食伤" ],
    ["水", "食伤",  "比劫", "印星", "官星", "财星" ],
    ["木", "财星",  "食伤", "比劫", "印星", "官星" ],
    ["火", "官星",  "财星", "食伤", "比劫", "印星" ],
    ["土", "印星",  "官星", "财星", "食伤", "比劫" ]
]

/**
* 根据日元查十神
* @param ganzhi 天干。
* @param riyuan 日元
* @return
*/
function queryShishen( tiangan,  riyuan) {
    var row = getYuezhuStart(SHISHEN_MAP[0], riyuan);
    var col = getYuezhuStart(SHISHEN_MAP[0], tiangan);
    return SHISHEN_MAP[row][col];
}

/**
 * 
 * @param {*} wx 五行
 * @param {*} riyuanWx 日元五行 
 * @returns 
 */
function queryShishenByWuxing(wx,  riyuanWx) {
    var col = WXSHISHENG_MAP[0].indexOf(riyuanWx);
    for ( var i=1;i<=5;i++ ){
        if (WXSHISHENG_MAP[i][0]==wx){
            return WXSHISHENG_MAP[i][col];
        }
    }
    return null;
}

/**
 * 找数组中月柱起始位置
 *
 * @param jiazhi
 * @param yuezhu
 * @return
 */
function getYuezhuStart(jiazhi, yuezhu) {
    var start = -1;
    for (var i = 0; i < jiazhi.length; i++) {
        if (yuezhu==jiazhi[i]) {
            start = i;
            break;
        }

    }
    return start;
}

/**
 * 查地支藏干十神.
 * @param dizhicanggan[] 藏干
 * @param riyuan 日元
 * @return [] 
 */
function dizhiShishen(dizhicanggan, riyuan){
    var list = [];
    for( var i=0;i<dizhicanggan.length;i++ ) {
        list.push(queryShishen(dizhicanggan[i], riyuan));
    }
    return list;
}

/**
 * 十神简称
 * @param sh 十神名称.
 * @return
 */
function shishenJc(sh) {
    var idx= -1;
    for( var i=0;i<SHISHEN.length;i++ ) {
        if( SHISHEN[i]==(sh) ) {
            idx=i;break;
        }
    }
    if( idx==-1 ) return "";
    return SHSH[idx];
}